fooping-tech/tab5_baby_monitor/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
# CONFIG_CODEC_I2C_BACKWARD_COMPATIBLE is not set
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
# app_main() now only starts the camera, UI and network services and then
# polls once a second, so it does not need the 32 KiB the still-image
# inference path used to require.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
# Allocations above this size go to PSRAM. Keep it small: during startup only
# the first L2MEM region is available to the allocator (the region holding the
# startup stack is marked startup_stack and joins the heap later), and on this
# app that is about 63 KiB with roughly 50 KiB already spent by the time the
# scheduler starts. Raising this to 16384 forced every sub-16 KiB allocation
# into that region, left 13 KiB, and the FreeRTOS timer task's 2 KiB stack then
# fell through to RTCRAM/TCM - neither of which is byte accessible, so
# xTaskCreateStaticPinnedToCore aborted before app_main ever ran.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=4096
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=4096
CONFIG_USB_HOST_HW_BUFFER_BIAS_IN=y
CONFIG_USB_HOST_DWC_DMA_CAP_MEMORY_IN_PSRAM=y
CONFIG_ESP_VIDEO_ENABLE_HW_H264_VIDEO_DEVICE=y
# CONFIG_ESP_VIDEO_ENABLE_MIPI_CSI_VIDEO_DEVICE is not set
# CONFIG_ESP_VIDEO_ENABLE_DVP_VIDEO_DEVICE is not set
# CONFIG_ESP_VIDEO_ENABLE_ISP_VIDEO_DEVICE is not set
# CONFIG_ESP_VIDEO_ENABLE_ISP_PIPELINE_CONTROLLER is not set
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
# CONFIG_ESP_HOSTED_SPI_HOST_INTERFACE is not set
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_LOW=y
CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_STREAMING_MODE=y
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=15
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_BUS_WIDTH=4
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=13
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=12
CONFIG_ESP_HOSTED_SDIO_PIN_D0=11
CONFIG_ESP_HOSTED_SDIO_PRIV_PIN_D1_4BIT_BUS=10
CONFIG_ESP_HOSTED_SDIO_PIN_D2=9
CONFIG_ESP_HOSTED_SDIO_PIN_D3=8
CONFIG_ESP_HOSTED_GPIO_SLAVE_RESET_SLAVE=15
CONFIG_ESP_HOSTED_RESET_GPIO_ACTIVE_LOW=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_USE_FONT_COMPRESSED=y
# CONFIG_LV_BUILD_EXAMPLES is not set
CONFIG_EDGE_HOSTNAME="tab5"

# edge_ai runs one non-preemptible ESP-DL pass of 2.4-3.5 s, so an idle task
# can legitimately be starved for several seconds. Both idle tasks stay
# watched, with a timeout wide enough to absorb one inference.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
# Do NOT enable CONFIG_ESP_SYSTEM_USE_EH_FRAME here. It gives RISC-V real panic
# backtraces, but the unwind tables add ~780 KiB of app image, and with
# CONFIG_SPIRAM_XIP_FROM_PSRAM that comes straight out of PSRAM: measured
# free PSRAM fell from 2323036 to 1775308 bytes and the largest free block
# dropped to exactly 2 MiB, so the RTSP 2 MiB USB input buffer no longer fit
# and every DESCRIBE failed. Enable it only in a scratch build while debugging
# a panic, and never in a build that also serves RTSP.

# ESP32-P4 pre-v3 silicon (this board reports "chip revision: v1.3") mishandles
# AHB/AXI bus arbitration when the USB DWC OTG controller runs isochronous
# transfers alongside another bus master: the USB DMA writes into the wrong
# SRAM address and corrupts whatever lives there. It surfaces here as
# "assert failed: spinlock_release" raised from intr_hdlr_main() in
# components/usb/hcd_dwc.c, i.e. the USB host ISR releasing a lock whose owner
# field has been overwritten. See espressif/esp-idf#18235, where the same
# signature appears with EMAC as the second master; the reporter measured an
# 8x improvement from TCPIP core locking, which also cuts how often the lwIP
# thread hands buffers around while USB DMA is active.
CONFIG_LWIP_TCPIP_CORE_LOCKING=y

# LVGL's built-in allocator is a 64 KiB static array in .bss. Where that array
# lands decides whether this firmware boots. ESP-IDF splits .bss into a low and
# a high region around the ROM stack area, and only the low one is inside the
# heap the allocator can use before the scheduler starts. While ESP-DL was
# linked its own .bss filled the low region and pushed LVGL's pool up to
# 0x4ff40000, out of the way. With ESP-DL gone the pool moved down to
# 0x4ff1ad24 and took 64 KiB of the ~63 KiB early heap with it, leaving 13 KiB;
# the FreeRTOS timer task's 2 KiB stack then fell through to RTCRAM/TCM, which
# are outside SOC_BYTE_ACCESSIBLE, and xTaskCreateStaticPinnedToCore aborted
# before app_main ran. Using the C library allocator removes the static pool
# and lets LVGL draw from the general heap, PSRAM included.
CONFIG_LV_USE_CLIB_MALLOC=y
